mariovirgili/CardputerGBC-Dual/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_5m_spiffs_8mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_5m_spiffs_8mb.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
# FATFS must expose long filenames; without this, readdir() returns 8.3 aliases
# such as AEROBI~2.SFC and save/title logic loses the real ROM name.
# CONFIG_FATFS_LFN_NONE is not set
CONFIG_FATFS_LFN_HEAP=y
# CONFIG_FATFS_LFN_STACK is not set
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
# CONFIG_FATFS_API_ENCODING_ANSI_OEM is not set
